{
  "projects": [
    {
      "name": "Personal Website",
      "description": "The website where I put my portfolio and more. Created using VueJs and VantaJs. No CSS framework was used.",
      "github": "https://github.com/UserR00T/Website",
      "website": "https://UserR00T.com"
    },
    {
      "name": "UniversialUnityHooks",
      "description": "UniversalUnityHooks aims to bring a adaptable modding API to any unity game. This is acomplished by hooking into methods found in the Assembly-CSharp.dll and modifying them while avoiding having to decompile and recompile. (Like RocketMod, but the basic version of it.)",
      "github": "https://github.com/UserR00T/UniversalUnityHooks"
    },
    {
      "name": "BP-Essentials",
      "description": "BP-Essentials aims to bring a simplistic yet powerful command suite to the game 'Broke Protocol'.",
      "github": "https://github.com/BPEssentials/",
      "website": "https://bpessentials.github.io/Docs/"
    },
    {
      "name": "NetChalker",
      "description": "A chalker library for .NET.",
      "github": "https://github.com/UserR00T/NetChalker"
    },
    {
      "name": "Pastr",
      "description": "An alternative to pastebin, hastebin, and gist.",
      "github": "https://github.com/pastr-git/",
      "website": "https://pastr.UserR00T.com"
    },
    {
      "name": "ShowMyRig",
      "description": "A website for the dutch content creator 'TechTime'. People can submit their own setup on this website and 'Team Techtime' will rate it. Made using Nuxt, Vue, VueRouter, VueX, Axios, ElementUI, and backend using Lumen.",
      "website": "https://www.showmyrig.nl/"
    },
    {
      "name": "SlidingPanel",
      "description": "Animate your panel's width and height.",
      "github": "https://github.com/UserR00T/SlidingPanel"
    },
    {
      "name": "TypeWriterEffect",
      "description": "Adds a TypeWriter effect to Windows Forms Application.",
      "github": "https://github.com/UserR00T/TypeWriterEffect"
    },
    {
      "name": "Broke Protocol",
      "description": "An open world online city RPG. - Co-developer for a 6 month period between 2019 and 2020.",
      "website": "https://brokeprotocol.com/",
      "github": "https://github.com/broke-protocol/"
    },
    {
      "name": "BP-CoreLib",
      "description": "Contains a list of helpful features for Broke Protocol plugins. Required core libary by a few plugins.",
      "github": "https://github.com/BPEssentials/BP-CoreLib"
    },
    {
      "name": "BP-Tools",
      "description": "BP-Tools contains various features and tools that can help with things ranging from uploading a map to the workshop to an ID list. Made using Vue, VueRouter, and ElementUI.",
      "github": "https://github.com/UserR00T/BP-Tools/",
      "website": "https://userr00t.github.io/BP-Tools/"
    },
    {
      "name": "BP-ServerList",
      "description": "BP-ServerList is a service that will fetch the latest server list and put it in a nice table. This is acomplished by createding a backend API that will handle all the hard work for you. Made using Vue, VueRouter, Axios, ElementUI, Highlight, and Lumen (backend).",
      "extraContent": "(removed)"
    },
    {
      "name": "BP-ConsoleMonitor",
      "description": "BP-ConsoleMonitor is a logtail program that constantly reads the contents of output_log.txt from the game 'Broke Protocol' to the console window. Though this Can easily be ported to read other files.",
      "extraContent": "(removed)"
    }
  ],
  "skills": [
    {
      "name": "Languages",
      "text": "C#, Javascript, Python, NativeScript, SQL, PHP"
    },
    {
      "name": "Frameworks/Libraries",
      "text": "(C#) Json.NET, MongoDB.Driver, LiteDB, Microsoft.CodeAnalysis.CSharp, Mono.Cecil, Mono.Cecil.Inject, commandline, Fody.Costura\n (JS) VanillaJS, Node.js, Vue/VueX/VueRouter/Nuxt, vue-i18n, JQuery  \n(PHP) Laravel/Lumen, \n(PYTHON) Flask, Graphene, Graphene-Mongo, MongoEngine, PyJWT\n(CSS) Element-UI, Tailwind, Bootstrap, Bootstrap-vue, Vuetify, Buefy, Keen-UI"
    },
    {
      "name": "Misc (Random stuff)",
      "text": "Visual Studio IDE 2015/2017/2019, Visual Studio Code, PHPStorm, DnSpy, Postman, HeidiSQL, MongoDB Compass, Laragon, GitHub, GitKraken, Unity, Git, OOP, SOLID, Reflection, GAC, Mono, Nginx, NetHandling, BinaryReader/Writer, .NET Core, .NET Framework"
    }
  ],
  "whoami": "Hi! My name is UserR00T, a full stack software developer (mostly focusing on backend right now) with tons of experience if a variety of languages. I know most about C# and Javascript (with or without TS support), but I have also used a lot of other languages in the past. For backend web applications I mostly use what is suited for the job, but if it doesn't have a specific requirement I use .NET Core ASP.NET. This, together with something like PostgreSQL or MySQL is a perfect combination for most jobs I've done in the past. For some projects I tend to use a more NoSQL based database, like MongoDB or LiteDB. These are great when the data getting inserted doesn't have schema. (which is pretty hard in strongly typed languages like C#) For frontend I mostly use Vue, though I would like to give React a go someday. I've also used NativeScript to create mobile apps, and WinForms/WPF for native desktop apps.\n\nYup, that's pretty much all you need to know.",
  "repoUrl": "https://api.github.com/users/UserR00T/repos?sort=updated&type=all",
  "contacts": [
    {
      "name": "Github",
      "href": "https://github.com/UserR00T"
    },
    {
      "name": "Gitlab",
      "href": "https://gitlab.com/UserR00T"
    },
    {
      "name": "Steam",
      "href": "https://steamcommunity.com/id/UserR00T/"
    },
    {
      "name": "Twitter",
      "href": "https://twitter.com/UserR00T_"
    },
    {
      "name": "contact@UserR00T.com",
      "href": "mailto:contact@UserR00T.com"
    },
    {
      "name": "UserR00T#5907"
    }
  ]
}
