{
  "projects": [
    {
      "name": "Personal Website",
      "description": "The website where I put my portfolio and more. Created using VueJs and VantaJs. No CSS framework was used.",
      "github": "https://github.com/UserR00T/Website",
      "website": "https://UserR00T.com"
    },
    {
      "name": "UniversialUnityHooks",
      "description": "UniversalUnityHooks aims to bring a adaptable modding API to any unity game. This is acomplished by hooking into methods found in the Assembly-CSharp.dll and modifying them while avoiding having to decompile and recompile. (Like RocketMod, but the basic version of it.)",
      "github": "https://github.com/UserR00T/UniversalUnityHooks"
    },
    {
      "name": "BP-Essentials",
      "description": "BP-Essentials aims to bring a simplistic yet powerful command suite to the game 'Broke Protocol'.",
      "github": "https://github.com/BPEssentials/",
      "website": "https://bpessentials.github.io/Docs/"
    },
    {
      "name": "NetChalker",
      "description": "A chalker library for .NET.",
      "github": "https://github.com/UserR00T/NetChalker"
    },
    {
      "name": "Pastr",
      "description": "An alternative to pastebin, hastebin, and gist.",
      "github": "https://github.com/pastr-git/",
      "website": "https://pastr.UserR00T.com"
    },
    {
      "name": "ShowMyRig",
      "description": "A website for the dutch content creator 'TechTime'. People can submit their own setup on this website and 'Team Techtime' will rate it. Made using Nuxt, Vue, VueRouter, VueX, Axios, ElementUI, and backend using Lumen.",
      "website": "https://www.showmyrig.nl/"
    },
    {
      "name": "SlidingPanel",
      "description": "Animate your panel's width and height.",
      "github": "https://github.com/UserR00T/SlidingPanel"
    },
    {
      "name": "TypeWriterEffect",
      "description": "Adds a TypeWriter effect to Windows Forms Application.",
      "github": "https://github.com/UserR00T/TypeWriterEffect"
    },
    {
      "name": "BP-CoreLib",
      "description": "Contains a list of helpful features for Broke Protocol plugins. Required core libary by a few plugins.",
      "github": "https://github.com/BPEssentials/BP-CoreLib"
    },
    {
      "name": "BP-Tools",
      "description": "BP-Tools contains various features and tools that can help with things ranging from uploading a map to the workshop to an ID list. Made using Vue, VueRouter, and ElementUI.",
      "github": "https://github.com/UserR00T/BP-Tools/",
      "website": "https://userr00t.github.io/BP-Tools/"
    },
    {
      "name": "BP-ServerList",
      "description": "BP-ServerList is a service that will fetch the latest server list and put it in a nice table. This is acomplished by createding a backend API that will handle all the hard work for you. Made using Vue, VueRouter, Axios, ElementUI, Highlight, and Lumen (backend).",
    },
    {
      "name": "BP-ConsoleMonitor",
      "description": "BP-ConsoleMonitor is a logtail program that constantly reads the contents of output_log.txt from the game 'Broke Protocol' to the console window. Though this Can easily be ported to read other files.",
    }
  ],
  "skills": [
    {
      "name": "Languages",
      "text": "CSharp (C#), PHP, Javascript, Python, HTML, CSS, SQL"
    },
    {
      "name": "Frameworks/Libraries",
      "text": "(C#) Json.NET, MongoDB.Driver, LiteDB, Microsoft.CodeAnalysis.CSharp, Mono.Cecil, Mono.Cecil.Inject, commandline, Fody.Costura,\n (JS) JQuery, VanillaJS, Node.js, Vue/VueX/VueRouter/Nuxt, vue-i18n, \n(PHP) Laravel/Lumen, \n(PYTHON) Flask, Graphene, Graphene-Mongo, MongoEngine, PyJWT, \n(CSS) Element-UI, Bootstrap, Bootstrap-vue, Vuetify, Buefy, Keen-UI"
    },
    {
      "name": "Misc",
      "text": "Visual Studio IDE 2015/2017/2019, Visual Studio Code, PHPStorm, DnSpy, Postman, HeidiSQL, MongoDB Compass, Laragon, GitHub, GitKraken, Unity, Git, OOP, SOLID, Reflection, GAC, Mono, Nginx, NetHandling, BinaryReader/Writer, .NET Core, .NET Framework"
    }
  ],
  "whoami": "Hi, my name is UserR00T, also known as root. I've been a software developer for over 3 years now. I have experience with multiple different languages, ranging from C# to something like Javascript. I can speak both Dutch and English. I also know a good bit of frontend, design, coding and whatnot. I normally don't do any frontend jobs unless I really need to, as I like working as backend developer more. For backend I use ASP.NET (C#) and I've used Laravel/Lumen (PHP) in the past. I'm also planning on learning a backend node.js framework in the future when I have some free time. For databases I used something like MySQL but since a while I've stepped over to NoSQL engines like MongoDB and LiteDB, and I was instantly hooked. I've never used MySQL after that, though I still can use it if needed. I also created windows applications using C# and WPF/WinForms in the past.\n\nYup, that's pretty much all you need to know.",
  "repoUrl": "https://api.github.com/users/UserR00T/repos?sort=updated&type=all",
  "contacts": [
    {
      "name": "Github",
      "href": "https://github.com/UserR00T"
    },
    {
      "name": "Gitlab",
      "href": "https://gitlab.com/UserR00T"
    },
    {
      "name": "Steam",
      "href": "https://steamcommunity.com/id/UserR00T/"
    },
    {
      "name": "Twitter",
      "href": "https://twitter.com/UserR00T_"
    },
    {
      "name": "contact@UserR00T.com",
      "href": "mailto:contact@UserR00T.com"
    },
    {
      "name": "UserR00T#5907"
    }
  ]
}
